---
kind: method
id: M:Autodesk.Revit.DB.PaperSizeSet.GetEnumerator
source: html/224a1434-3388-a1ed-57b7-a13f0c7e4232.htm
---
# Autodesk.Revit.DB.PaperSizeSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.